package util_p;

import java.util.regex.Pattern;

//regular Expression : 정규 표현식
public class RegexMain {

	public static void main(String[] args) {

		System.out.println("이신협".startsWith("이"));
		System.out.println("삼신협".startsWith("이"));

		System.out.println(Pattern.matches("장", "장동건"));
		System.out.println(Pattern.matches("장.*", "장동건"));
		System.out.println(Pattern.matches(".*장", "장동건"));
		System.out.println(Pattern.matches(".*장.*", "장동건"));
		
		
		String [] mmArr= {"장동건","건","장서건","장혁","장남건","장3","장빈건",
                "장","장군","최장군","박장군","장군님","장장장장장장장","장장","고추장",
                "미란다커","키커","쌍피","계피","원두커피장군",
                "장장장","김앤장이다","현빈","원빈","미스터빈","커피빈","커피","원두커피","장희빈",
                "ㄱㄴㄷ","ㄱㄹㄴ","ㅐㅓㅣㅔㅐ","ㅐㅔㅓㅐㅑㅓ","ㄱㅓㅔㅔㅔㄹㄴ",
                "하하하","하호허","팉툍하","하학","하햐","가긱공국","짱쩡맨","쑥ㄴ밬","샹쏑쑗",
                "다","공석호","김희애","*","***","*******",
                "나야비","나비야","농ㅂ왕창","장ㄴ비용솽",
                "너탈비털아붕니","너비아니","헤르너비아샹쵕",
                "123-456","1234-5678",
                "1234-5678-9012","123-5678-9012","12-5678-9012","12-568-9012",
                "123-678-9012","123-567833-9012","12-58-9012","1a",
                "abc","abc_def","1234","9846","ab_1234","ab1234",
                "aaa@aaa.aaa","aaaaaa.aaa@","aaa12aaa_aaa@",
                "ab56","AABB","aBCd","1","3","1234abc@aaa.aaa",
                "1234abc@aaa.a","1a2b","a12",
                "^","^^","12^34abc@aaa.aaa","1a2b^","^a12","123456.^",
                "\\^","^\\^",".^","\\^^",
                "1234abc@aaa.aa.va","1234abc@a.aa.a.a.va"};
	
		String [] ppArr = {
				"장","장군","장.",".빈","..빈",".장.",
				"장*","장.*",".*빈",".*장.*",
				".*빈건",".*(빈건)",".*(빈|건)",".*빈|건",".*[빈건]",
				".*(커피|장군)",".*[커피|장군]",".*[커피장군]",
				"\\*","\\**","[*]","[*]*",//"*"
				"\\d","\\d*","\\D*","\\w*","\\W*",
				"[0-9]","[0-9]*","[a-z]*","[A-Z]*","[0-9a-zA-Z]*",
				"[0-9a-zA-Z._@-]*","[0-9a-zA-Z_]*@[0-9a-zA-Z._@]*",
				".{4}",".{3,7}",".{5,}",//".{,10}"
				"[0-9]{2,3}-\\d{3,4}-[0-9]{4}",
				"[^0-9]*","[0-9^]*","^*",//"[^]*"
				"\\^*","[\\^]*","[^^]*","^^*","^^^*",
				"[ㄱ-ㅎ]*","[ㅏ-ㅣ]*","[가-힣]*","[가-힣ㄱ-ㅎㅏ-ㅣ]*",
				".*[가-깋].*",".*[나-닣][바-빟][아-잏].*"
		
		};
		for (String pp : ppArr) {
			System.out.print(pp + " : ");
			for (String mm : mmArr) {
				if(Pattern.matches(pp, mm)) {
					System.out.print(mm+",");
				}
			}
			System.out.println();
		}
		/*
		 //// 회원 가입 유효성 검사를 실시하세요
1. 아이디 : 영문 숫자 만 가능(4자이상)
2. 비번 , 비번확인(5자이상, 대소문자,특수문자조합 ) 
3. 이메일  -  아이디:영문,숫자(3글자이상)   @  도메인 : 영문 점
4. 전화번호 - 숫자 :  ###-####-####,   ##(#)-###-####
5. 이름 (한글만 가능) 2~5자
6. 주민번호 
7. 사진 첨부-->영문,숫자(3글자 이상).이미지 확장자
이미지(jpg, jpeg, bmp, png, gif)  --  대소문자 구분없음
8. 우편번호 검색 - 구단위 (초성검색)
예외처리로 처리할 것
		 * */
	}

}
